[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:9:45
  * Recibe como argumento un "fetcher" (función que retorna una promesa con { value: number }).
  * Valida el contrato y aplica una regla de negocio: duplicar el valor recibido.
  */
-async function processExternalData(fetcher) {
-  const fn = fetcher || externalModule.fetchData; // usa el espía si existe
-  const data = await fn();
-  if (!data || typeof data.value !== "number") {
-    throw new Error("Invalid contract: value must be a number");
-  }
-  return data.value * 2;
-}
+async function processExternalData(fetcher) {}
 
  /* Permite opcionalmente aplicar una función de transformación (keyFn) sobre los elementos.
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: Expected undefined to be 10.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:10:14
  * Valida el contrato y aplica una regla de negocio: duplicar el valor recibido.
  */
 async function processExternalData(fetcher) {
-  const fn = fetcher || externalModule.fetchData; // usa el espía si existe
+  const fn = false; // usa el espía si existe
   const data = await fn();
   if (!data || typeof data.value !== "number") {
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: TypeError: fn is not a function

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:10:14
  * Valida el contrato y aplica una regla de negocio: duplicar el valor recibido.
  */
 async function processExternalData(fetcher) {
-  const fn = fetcher || externalModule.fetchData; // usa el espía si existe
+  const fn = true; // usa el espía si existe
   const data = await fn();
   if (!data || typeof data.value !== "number") {
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: TypeError: fn is not a function

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:12:7
 async function processExternalData(fetcher) {
   const fn = fetcher || externalModule.fetchData; // usa el espía si existe
   const data = await fn();
-  if (!data || typeof data.value !== "number") {
+  if (true) {
     throw new Error("Invalid contract: value must be a number");
   }
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: Error: Invalid contract: value must be a number

[Killed] BooleanLiteral
binary_search/js/binarySearchLogic.js:12:7
 async function processExternalData(fetcher) {
   const fn = fetcher || externalModule.fetchData; // usa el espía si existe
   const data = await fn();
-  if (!data || typeof data.value !== "number") {
+  if (data || typeof data.value !== "number") {
     throw new Error("Invalid contract: value must be a number");
   }
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: Error: Invalid contract: value must be a number

[Killed] ArithmeticOperator
binary_search/js/binarySearchLogic.js:15:10
   if (!data || typeof data.value !== "number") {
     throw new Error("Invalid contract: value must be a number");
   }
-  return data.value * 2;
+  return data.value / 2;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic processExternalData duplica el valor recibido
statusReason: Expected 2.5 to be 10.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:20:49
 
  /* Permite opcionalmente aplicar una función de transformación (keyFn) sobre los elementos.
  */
-function findIndex(arr, target, keyFn = x => x) {
-  let left = 0;
-  let right = arr.length - 1;
-  while (left <= right) {
-    const mid = Math.floor((left + right) / 2);
-    const value = keyFn(arr[mid]);
-    if (value === target) return mid;
-    if (value < target) left = mid + 1;
-    else right = mid - 1;
-  }
-  return null;
-}
+function findIndex(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected undefined to be 2.

[Survived] ArrowFunction
binary_search/js/binarySearchLogic.js:20:41
 
  /* Permite opcionalmente aplicar una función de transformación (keyFn) sobre los elementos.
  */
-function findIndex(arr, target, keyFn = x => x) {
+function findIndex(arr, target, keyFn = () => undefined) {
   let left = 0;
   let right = arr.length - 1;

[Survived] ArithmeticOperator
binary_search/js/binarySearchLogic.js:22:15
  */
 function findIndex(arr, target, keyFn = x => x) {
   let left = 0;
-  let right = arr.length - 1;
+  let right = arr.length + 1;
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:23:10
 function findIndex(arr, target, keyFn = x => x) {
   let left = 0;
   let right = arr.length - 1;
-  while (left <= right) {
+  while (left > right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:23:10
 function findIndex(arr, target, keyFn = x => x) {
   let left = 0;
   let right = arr.length - 1;
-  while (left <= right) {
+  while (false) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:26:9
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
-    if (value === target) return mid;
+    if (true) return mid;
     if (value < target) left = mid + 1;
     else right = mid - 1;
killedBy: Pruebas unitarias de binarySearchLogic binarySearch devuelve null si no existe
statusReason: Expected 2 to be null.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:26:9
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
-    if (value === target) return mid;
+    if (value !== target) return mid;
     if (value < target) left = mid + 1;
     else right = mid - 1;
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected 0 to be 2.

[Survived] EqualityOperator
binary_search/js/binarySearchLogic.js:27:9
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
     if (value === target) return mid;
-    if (value < target) left = mid + 1;
+    if (value <= target) left = mid + 1;
     else right = mid - 1;
   }

[Timeout] ArithmeticOperator
binary_search/js/binarySearchLogic.js:27:32
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
     if (value === target) return mid;
-    if (value < target) left = mid + 1;
+    if (value < target) left = mid - 1;
     else right = mid - 1;
   }

[Survived] ArithmeticOperator
binary_search/js/binarySearchLogic.js:28:18
     const value = keyFn(arr[mid]);
     if (value === target) return mid;
     if (value < target) left = mid + 1;
-    else right = mid - 1;
+    else right = mid + 1;
   }
   return null;

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:35:44
 
 /**
  * Función básica de búsqueda binaria*/
-function binarySearch(arr, target, keyFn = x => x) {
+function binarySearch(arr, target, keyFn = () => undefined) {
   return findIndex(arr, target, keyFn);
 }
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected null to be 2.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:35:52
 
 /**
  * Función básica de búsqueda binaria*/
-function binarySearch(arr, target, keyFn = x => x) {
-  return findIndex(arr, target, keyFn);
-}
+function binarySearch(arr, target, keyFn = x => x) {}
 /**
  * Verifica si un valor existe en el arreglo.
killedBy: Pruebas unitarias de binarySearchLogic binarySearch encuentra un elemento existente
statusReason: Expected undefined to be 2.

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:41:40
 /**
  * Verifica si un valor existe en el arreglo.
  */
-function contains(arr, target, keyFn = x => x) {
+function contains(arr, target, keyFn = () => undefined) {
   return findIndex(arr, target, keyFn) !== null;
 }
killedBy: Pruebas unitarias de binarySearchLogic contains detecta si un valor existe
statusReason: Expected false to be true.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:41:48
 /**
  * Verifica si un valor existe en el arreglo.
  */
-function contains(arr, target, keyFn = x => x) {
-  return findIndex(arr, target, keyFn) !== null;
-}
+function contains(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic contains detecta si un valor existe
statusReason: Expected undefined to be true.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:42:10
  * Verifica si un valor existe en el arreglo.
  */
 function contains(arr, target, keyFn = x => x) {
-  return findIndex(arr, target, keyFn) !== null;
+  return true;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic contains detecta si un valor existe
statusReason: Expected true to be false.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:42:10
  * Verifica si un valor existe en el arreglo.
  */
 function contains(arr, target, keyFn = x => x) {
-  return findIndex(arr, target, keyFn) !== null;
+  return false;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic contains detecta si un valor existe
statusReason: Expected false to be true.

[Survived] BlockStatement
binary_search/js/binarySearchLogic.js:48:44
 /**
  * Devuelve el elemento encontrado o null si no existe.
  */
-function find(arr, target, keyFn = x => x) {
-  const idx = findIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
-}
+function find(arr, target, keyFn = x => x) {}
 
 /**

[Survived] ArrowFunction
binary_search/js/binarySearchLogic.js:48:36
 /**
  * Devuelve el elemento encontrado o null si no existe.
  */
-function find(arr, target, keyFn = x => x) {
+function find(arr, target, keyFn = () => undefined) {
   const idx = findIndex(arr, target, keyFn);
   return idx !== null ? arr[idx] : null;

[Survived] ConditionalExpression
binary_search/js/binarySearchLogic.js:50:10
  */
 function find(arr, target, keyFn = x => x) {
   const idx = findIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return true ? arr[idx] : null;
 }
 

[Survived] EqualityOperator
binary_search/js/binarySearchLogic.js:50:10
  */
 function find(arr, target, keyFn = x => x) {
   const idx = findIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return idx === null ? arr[idx] : null;
 }
 

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:56:57
 /**
  * Busca el índice más a la izquierda de un valor repetido.
  */
-function findLeftmostIndex(arr, target, keyFn = x => x) {
-  let left = 0;
-  let right = arr.length - 1;
-  let result = null;
-  while (left <= right) {
-    const mid = Math.floor((left + right) / 2);
-    const value = keyFn(arr[mid]);
-    if (value === target) {
-      result = mid;
-      right = mid - 1; // sigue buscando a la izquierda
-    } else if (value < target) {
-      left = mid + 1;
-    } else {
-      right = mid - 1;
-    }
-  }
-  return result;
-}
+function findLeftmostIndex(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected undefined to be 2.

[Survived] ArrowFunction
binary_search/js/binarySearchLogic.js:56:49
 /**
  * Busca el índice más a la izquierda de un valor repetido.
  */
-function findLeftmostIndex(arr, target, keyFn = x => x) {
+function findLeftmostIndex(arr, target, keyFn = () => undefined) {
   let left = 0;
   let right = arr.length - 1;

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:60:10
   let left = 0;
   let right = arr.length - 1;
   let result = null;
-  while (left <= right) {
+  while (left > right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:60:10
   let left = 0;
   let right = arr.length - 1;
   let result = null;
-  while (left <= right) {
+  while (false) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:63:9
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
-    if (value === target) {
+    if (false) {
       result = mid;
       right = mid - 1; // sigue buscando a la izquierda
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:63:9
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
-    if (value === target) {
+    if (true) {
       result = mid;
       right = mid - 1; // sigue buscando a la izquierda
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected 1 to be 2.

[Timeout] ArithmeticOperator
binary_search/js/binarySearchLogic.js:65:15
     const value = keyFn(arr[mid]);
     if (value === target) {
       result = mid;
-      right = mid - 1; // sigue buscando a la izquierda
+      right = mid + 1; // sigue buscando a la izquierda
     } else if (value < target) {
       left = mid + 1;

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:66:16
     if (value === target) {
       result = mid;
       right = mid - 1; // sigue buscando a la izquierda
-    } else if (value < target) {
+    } else if (false) {
       left = mid + 1;
     } else {
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 2 to equal 3.
Expected $[0] = 2 to equal 1.
Expected $[1] = 3 to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:66:16
     if (value === target) {
       result = mid;
       right = mid - 1; // sigue buscando a la izquierda
-    } else if (value < target) {
+    } else if (value >= target) {
       left = mid + 1;
     } else {
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 2 to equal 3.
Expected $[0] = 2 to equal 1.
Expected $[1] = 3 to equal 2.
Expected $[2] = undefined to equal 3.

[Timeout] ArithmeticOperator
binary_search/js/binarySearchLogic.js:67:14
       result = mid;
       right = mid - 1; // sigue buscando a la izquierda
     } else if (value < target) {
-      left = mid + 1;
+      left = mid - 1;
     } else {
       right = mid - 1;

[Survived] BlockStatement
binary_search/js/binarySearchLogic.js:68:12
       right = mid - 1; // sigue buscando a la izquierda
     } else if (value < target) {
       left = mid + 1;
-    } else {
-      right = mid - 1;
-    }
+    } else {}
   }
   return result;

[Survived] ArithmeticOperator
binary_search/js/binarySearchLogic.js:69:15
     } else if (value < target) {
       left = mid + 1;
     } else {
-      right = mid - 1;
+      right = mid + 1;
     }
   }

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:78:50
 /**
  * Busca el índice más a la derecha de un valor repetido.
  */
-function findRightmostIndex(arr, target, keyFn = x => x) {
+function findRightmostIndex(arr, target, keyFn = () => undefined) {
   let left = 0;
   let right = arr.length - 1;
killedBy: Pruebas unitarias de binarySearchLogic findRightmostIndex devuelve el último índice en duplicados
statusReason: Expected null to be 3.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:78:58
 /**
  * Busca el índice más a la derecha de un valor repetido.
  */
-function findRightmostIndex(arr, target, keyFn = x => x) {
-  let left = 0;
-  let right = arr.length - 1;
-  let result = null;
-  while (left <= right) {
-    const mid = Math.floor((left + right) / 2);
-    const value = keyFn(arr[mid]);
-    if (value === target) {
-      result = mid;
-      left = mid + 1; // sigue buscando a la derecha
-    } else if (value < target) {
-      left = mid + 1;
-    } else {
-      right = mid - 1;
-    }
-  }
-  return result;
-}
+function findRightmostIndex(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected undefined to be 2.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:85:9
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     const value = keyFn(arr[mid]);
-    if (value === target) {
+    if (value !== target) {
       result = mid;
       left = mid + 1; // sigue buscando a la derecha
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected 1 to be 2.

[Timeout] ArithmeticOperator
binary_search/js/binarySearchLogic.js:87:14
     const value = keyFn(arr[mid]);
     if (value === target) {
       result = mid;
-      left = mid + 1; // sigue buscando a la derecha
+      left = mid - 1; // sigue buscando a la derecha
     } else if (value < target) {
       left = mid + 1;

[Survived] EqualityOperator
binary_search/js/binarySearchLogic.js:88:16
     if (value === target) {
       result = mid;
       left = mid + 1; // sigue buscando a la derecha
-    } else if (value < target) {
+    } else if (value <= target) {
       left = mid + 1;
     } else {

[Survived] EqualityOperator
binary_search/js/binarySearchLogic.js:88:16
     if (value === target) {
       result = mid;
       left = mid + 1; // sigue buscando a la derecha
-    } else if (value < target) {
+    } else if (value >= target) {
       left = mid + 1;
     } else {

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:100:46
 /**
  * Devuelve todos los índices donde aparece el valor buscado.
  */
-function findAllIndices(arr, target, keyFn = x => x) {
+function findAllIndices(arr, target, keyFn = () => undefined) {
   const indices = [];
   let idx = findLeftmostIndex(arr, target, keyFn);
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 1.
Expected $[1] = undefined to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:100:54
 /**
  * Devuelve todos los índices donde aparece el valor buscado.
  */
-function findAllIndices(arr, target, keyFn = x => x) {
-  const indices = [];
-  let idx = findLeftmostIndex(arr, target, keyFn);
-  if (idx === null) return indices;
-  let rightIdx = findRightmostIndex(arr, target, keyFn);
-  for (let i = idx; i <= rightIdx; i++) {
-    indices.push(i);
-  }
-  return indices;
-}
+function findAllIndices(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected undefined to equal [ 1, 2, 3 ].

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:103:7
 function findAllIndices(arr, target, keyFn = x => x) {
   const indices = [];
   let idx = findLeftmostIndex(arr, target, keyFn);
-  if (idx === null) return indices;
+  if (idx !== null) return indices;
   let rightIdx = findRightmostIndex(arr, target, keyFn);
   for (let i = idx; i <= rightIdx; i++) {
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 1.
Expected $[1] = undefined to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:103:7
 function findAllIndices(arr, target, keyFn = x => x) {
   const indices = [];
   let idx = findLeftmostIndex(arr, target, keyFn);
-  if (idx === null) return indices;
+  if (true) return indices;
   let rightIdx = findRightmostIndex(arr, target, keyFn);
   for (let i = idx; i <= rightIdx; i++) {
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 1.
Expected $[1] = undefined to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:105:21
   let idx = findLeftmostIndex(arr, target, keyFn);
   if (idx === null) return indices;
   let rightIdx = findRightmostIndex(arr, target, keyFn);
-  for (let i = idx; i <= rightIdx; i++) {
+  for (let i = idx; i > rightIdx; i++) {
     indices.push(i);
   }
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 1.
Expected $[1] = undefined to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:105:21
   let idx = findLeftmostIndex(arr, target, keyFn);
   if (idx === null) return indices;
   let rightIdx = findRightmostIndex(arr, target, keyFn);
-  for (let i = idx; i <= rightIdx; i++) {
+  for (let i = idx; false; i++) {
     indices.push(i);
   }
killedBy: Pruebas unitarias de binarySearchLogic findAllIndices devuelve todos los índices de duplicados
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 1.
Expected $[1] = undefined to equal 2.
Expected $[2] = undefined to equal 3.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:114:52
 /**
  * Devuelve el elemento más a la izquierda que coincide con el target.
  */
-function findLeftmost(arr, target, keyFn = x => x) {
-  const idx = findLeftmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
-}
+function findLeftmost(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected undefined to be 2.

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:114:44
 /**
  * Devuelve el elemento más a la izquierda que coincide con el target.
  */
-function findLeftmost(arr, target, keyFn = x => x) {
+function findLeftmost(arr, target, keyFn = () => undefined) {
   const idx = findLeftmostIndex(arr, target, keyFn);
   return idx !== null ? arr[idx] : null;
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:116:10
  */
 function findLeftmost(arr, target, keyFn = x => x) {
   const idx = findLeftmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return false ? arr[idx] : null;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:116:10
  */
 function findLeftmost(arr, target, keyFn = x => x) {
   const idx = findLeftmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return idx === null ? arr[idx] : null;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] BlockStatement
binary_search/js/binarySearchLogic.js:122:53
 /**
  * Devuelve el elemento más a la derecha que coincide con el target.
  */
-function findRightmost(arr, target, keyFn = x => x) {
-  const idx = findRightmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
-}
+function findRightmost(arr, target, keyFn = x => x) {}
 
 /**
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected undefined to be 2.

[Killed] ArrowFunction
binary_search/js/binarySearchLogic.js:122:45
 /**
  * Devuelve el elemento más a la derecha que coincide con el target.
  */
-function findRightmost(arr, target, keyFn = x => x) {
+function findRightmost(arr, target, keyFn = () => undefined) {
   const idx = findRightmostIndex(arr, target, keyFn);
   return idx !== null ? arr[idx] : null;
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] EqualityOperator
binary_search/js/binarySearchLogic.js:124:10
  */
 function findRightmost(arr, target, keyFn = x => x) {
   const idx = findRightmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return idx === null ? arr[idx] : null;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Killed] ConditionalExpression
binary_search/js/binarySearchLogic.js:124:10
  */
 function findRightmost(arr, target, keyFn = x => x) {
   const idx = findRightmostIndex(arr, target, keyFn);
-  return idx !== null ? arr[idx] : null;
+  return false ? arr[idx] : null;
 }
 
killedBy: Pruebas unitarias de binarySearchLogic findLeftmost y findRightmost manejan duplicados
statusReason: Expected null to be 2.

[Survived] ArrowFunction
binary_search/js/binarySearchLogic.js:130:39
 /**
  * Devuelve todos los elementos que coinciden con el target.
  */
-function findAll(arr, target, keyFn = x => x) {
+function findAll(arr, target, keyFn = () => undefined) {
   const indices = findAllIndices(arr, target, keyFn);
   return indices.map(i => arr[i]);

[Survived] BlockStatement
binary_search/js/binarySearchLogic.js:130:47
 /**
  * Devuelve todos los elementos que coinciden con el target.
  */
-function findAll(arr, target, keyFn = x => x) {
-  const indices = findAllIndices(arr, target, keyFn);
-  return indices.map(i => arr[i]);
-}
+function findAll(arr, target, keyFn = x => x) {}
 
 // Exportamos todas las funciones para que puedan ser usadas en las pruebas

[Survived] ArrowFunction
binary_search/js/binarySearchLogic.js:132:22
  */
 function findAll(arr, target, keyFn = x => x) {
   const indices = findAllIndices(arr, target, keyFn);
-  return indices.map(i => arr[i]);
+  return indices.map(() => undefined);
 }
 
